
#### Directory: 'azuread-users-groups-roles'
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`            

<details><summary>Show Plan</summary>

```

terraform
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=014901d1-96d2-44c7-b544-19cdb78cbb62-4c6e2a99-c195-4a94-86a3-454b5df9a81b-79c16aba-6d51-45b6-af39-de4f4ba929cb]
data.azurerm_subscription.current: Reading...
data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/52209a4b-4500-4169-8059-48c84696155a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_resource_group.artgroup will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "artgroup" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "artgroup"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azuread_conditional_access_policy.Art_access_policy will be created
  + resource "azuread_conditional_access_policy" "Art_access_policy" {
      + display_name = "Art policy"
      + id           = (known after apply)
      + state        = "enabled"

      + conditions {
          + client_app_types = [
              + "all",
            ]

          + applications {
              + excluded_applications = []
              + included_applications = [
                  + "All",
                ]
            }

          + users {
              + included_groups = (known after apply)
            }
        }

      + grant_controls {
          + built_in_controls = [
              + "mfa",
            ]
          + operator          = "OR"
        }
    }

  # azuread_group.Art will be created
  + resource "azuread_group" "Art" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Art"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = [
          + "79c16aba-6d51-45b6-af39-de4f4ba929cb",
        ]
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + types                          = [
          + "DynamicMembership",
        ]
      + visibility                     = (known after apply)

      + dynamic_membership {
          + enabled = true
          + rule    = "user.department -eq \"Art\""
        }
    }

  # azuread_group.Engineering will be created
  + resource "azuread_group" "Engineering" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Engineering"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = [
          + "79c16aba-6d51-45b6-af39-de4f4ba929cb",
        ]
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + types                          = [
          + "DynamicMembership",
        ]
      + visibility                     = (known after apply)

      + dynamic_membership {
          + enabled = true
          + rule    = "user.department -eq \"Engineering\""
        }
    }

  # azuread_group.Readers will be created
  + resource "azuread_group" "Readers" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Readers"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = [
          + "79c16aba-6d51-45b6-af39-de4f4ba929cb",
        ]
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + types                          = [
          + "DynamicMembership",
        ]
      + visibility                     = (known after apply)

      + dynamic_membership {
          + enabled = true
          + rule    = "user.userPrincipalName -contains \"jennasrunbooks\""
        }
    }

  # azuread_user.Bob_Ross will be created
  + resource "azuread_user" "Bob_Ross" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + creation_type                  = (known after apply)
      + department                     = "Art"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Bob Ross"
      + external_user_state            = (known after apply)
      + force_password_change          = true
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "bobross@jennasrunbooks.com"
      + user_type                      = (known after apply)
    }

  # azuread_user.Roy_Trenneman will be created
  + resource "azuread_user" "Roy_Trenneman" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + creation_type                  = (known after apply)
      + department                     = "Engineering"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Roy Trenneman"
      + external_user_state            = (known after apply)
      + force_password_change          = true
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "roytrenneman@jennasrunbooks.com"
      + user_type                      = (known after apply)
    }

  # azurerm_resource_group.artgroup will be created
  + resource "azurerm_resource_group" "artgroup" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "artgroup"
    }

  # azurerm_role_assignment.Contributor_role_art will be created
  + resource "azurerm_role_assignment" "Contributor_role_art" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.Custom_storage_tfstate_role will be created
  + resource "azurerm_role_assignment" "Custom_storage_tfstate_role" {
      + description                      = "Custom storage role for managing tf state blob"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "CustomStoragetfStateRole"
      + scope                            = "/subscriptions/52209a4b-4500-4169-8059-48c84696155a/resourceGroups/centralus-jennasrunbookstf/providers/Microsoft.Storage/storageAccounts/jennasrunbookstfstate"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.Reader_role_all will be created
  + resource "azurerm_role_assignment" "Reader_role_all" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/52209a4b-4500-4169-8059-48c84696155a"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_definition.Custom_storage_tfstate_role will be created
  + resource "azurerm_role_definition" "Custom_storage_tfstate_role" {
      + assignable_scopes           = (known after apply)
      + description                 = "Custom storage role definition"
      + id                          = (known after apply)
      + name                        = "CustomStoragetfStateRole"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/subscriptions/52209a4b-4500-4169-8059-48c84696155a/resourceGroups/centralus-jennasrunbookstf/providers/Microsoft.Storage/storageAccounts/jennasrunbookstfstate"

      + permissions {
          + actions     = [
              + "Microsoft.Storage/storageAccounts/listKeys/action",
              + "Microsoft.Storage/storageAccounts/regeneratekey/action",
              + "Microsoft.Storage/storageAccounts/blobServices/generateUserDelegationKey/action",
            ]
          + not_actions = []
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jksprattler, Action: `pull_request`*